app/controllers/pictures_controller.rb

SELECT "pictures".* FROM "pictures"  ORDER BY created_at DESC
---
	def index
		@pictures = Picture.all

INSERT INTO "pictures" ("artist", "title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["artist", "john"], ["title", "john"], ["url", "jhhnbh"], ["created_at", "2015-02-03 22:26:09.125360"], ["updated_at", "2015-02-03 22:26:09.125360"]]
---
  def create
  	@picture = Picture.new(picture_params)
  	if @picture.save

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT 1  [["id", 34]]
DELETE FROM "pictures" WHERE "pictures"."id" = ?  [["id", 34]]
---
  def destroy
    @picture = Picture.find(params[:id])
    @picture.destroy